export const LINES = [
    {
        "name": "淡水信義線",
        "color": "var(--red)",
        "stations": [
            {
                "id": "R28",
                "name": "淡水",
                "x": 134,
                "y": 213
            },
            {
                "id": "R27",
                "name": "紅樹林",
                "x": 163,
                "y": 252
            },
            {
                "id": "R26",
                "name": "竹圍",
                "x": 163,
                "y": 296
            },
            {
                "id": "R25",
                "name": "關渡",
                "x": 162,
                "y": 340
            },
            {
                "id": "R24",
                "name": "忠義",
                "x": 200,
                "y": 366
            },
            {
                "id": "R23",
                "name": "復興崗",
                "x": 247,
                "y": 366
            },
            {
                "id": "R22",
                "name": "北投",
                "x": 298,
                "y": 366,
                "transfer": [
                    "R",
                    "P"
                ]
            },
            {
                "id": "R21",
                "name": "奇岩",
                "x": 327,
                "y": 393
            },
            {
                "id": "R20",
                "name": "唭哩岸",
                "x": 354,
                "y": 420
            },
            {
                "id": "R19",
                "name": "石牌",
                "x": 382,
                "y": 449
            },
            {
                "id": "R18",
                "name": "明德",
                "x": 408,
                "y": 483
            },
            {
                "id": "R17",
                "name": "芝山",
                "x": 408,
                "y": 528
            },
            {
                "id": "R16",
                "name": "士林",
                "x": 408,
                "y": 572
            },
            {
                "id": "R15",
                "name": "劍潭",
                "x": 408,
                "y": 612
            },
            {
                "id": "R14",
                "name": "圓山",
                "x": 408,
                "y": 663
            },
            {
                "id": "R13",
                "name": "民權西路",
                "x": 408,
                "y": 713,
                "transfer": [
                    "R",
                    "O"
                ]
            },
            {
                "id": "R12",
                "name": "雙連",
                "x": 408,
                "y": 757
            },
            {
                "id": "R11",
                "name": "中山",
                "x": 408,
                "y": 800,
                "transfer": [
                    "R",
                    "G"
                ]
            },
            {
                "id": "R10",
                "name": "台北車站",
                "x": 408,
                "y": 870,
                "transfer": [
                    "R",
                    "BL",
                    "G"
                ]
            },
            {
                "id": "R09",
                "name": "台大醫院",
                "x": 408,
                "y": 942
            },
            {
                "id": "R08",
                "name": "中正紀念堂",
                "x": 408,
                "y": 942,   
                "transfer": [
                    "R",
                    "G"
                ]
            },
            {
                "id": "R07",
                "name": "東門",
                "x": 489,
                "y": 942,
                "transfer": [
                    "R",
                    "O"
                ]
            },
            {
                "id": "R06",
                "name": "大安森林公園",
                "x": 518,
                "y": 942
            },
            {
                "id": "R05",
                "name": "大安",
                "x": 561,
                "y": 942,
                "transfer": [
                    "R",
                    "BR"
                ]
            },
            {
                "id": "R04",
                "name": "信義安和",
                "x": 621,
                "y": 942
            },
            {
                "id": "R03",
                "name": "台北101/世貿",
                "x": 672,
                "y": 942
            },
            {
                "id": "R02",
                "name": "象山",
                "x": 715,
                "y": 942
            }
        ]
    },
    {
        "name": "板南線",
        "color": "var(--blue)",
        "stations": [
            {
                "id": "BL23",
                "name": "南港展覽館",
                "x": 903,
                "y": 815
            },
            {
                "id": "BL22",
                "name": "南港",
                "x": 852,
                "y": 815
            },
            {
                "id": "BL21",
                "name": "昆陽",
                "x": 807,
                "y": 815
            },
            {
                "id": "BL20",
                "name": "後山埤",
                "x": 777,
                "y": 850
            },
            {
                "id": "BL19",
                "name": "永春",
                "x": 738,
                "y": 870
            },
            {
                "id": "BL18",
                "name": "市政府",
                "x": 697,
                "y": 870
            },
            {
                "id": "BL17",
                "name": "國父紀念館",
                "x": 656,
                "y": 870
            },
            {
                "id": "BL16",
                "name": "忠孝敦化",
                "x": 613,
                "y": 870
            },
            {
                "id": "BL15",
                "name": "忠孝復興",
                "x": 561,
                "y": 870,
                "transfer": [
                    "BL",
                    "BR"
                ]
            },
            {
                "id": "BL14",
                "name": "忠孝新生",
                "x": 489,
                "y": 870,
                "transfer": [
                    "BL",
                    "O"
                ]
            },
            {
                "id": "BL13",
                "name": "善導寺",
                "x": 449,
                "y": 870
            },
            {
                "id": "BL12",
                "name": "台北車站",
                "x": 408,
                "y": 870,
                "transfer": [
                    "BL",
                    "R",
                    "G"
                ]
            },
            {
                "id": "BL11",
                "name": "西門",
                "x": 350,
                "y": 870,
                "transfer": [
                    "BL",
                    "G"
                ]
            },
            {
                "id": "BL10",
                "name": "龍山寺",
                "x": 280,
                "y": 920
            },
            {
                "id": "BL09",
                "name": "江子翠",
                "x": 220,
                "y": 973
            },
            {
                "id": "BL08",
                "name": "新埔",
                "x": 181,
                "y": 1016
            },
            {
                "id": "BL07",
                "name": "板橋",
                "x": 181,
                "y": 1058,
                "transfer": [
                    "BL",
                    "O"
                ]
            },
            {
                "id": "BL06",
                "name": "府中",
                "x": 181,
                "y": 1104
            },
            {
                "id": "BL05",
                "name": "亞東醫院",
                "x": 181,
                "y": 1149
            },
            {
                "id": "BL04",
                "name": "海山",
                "x": 181,
                "y": 1194
            },
            {
                "id": "BL03",
                "name": "土城",
                "x": 181,
                "y": 1238
            },
            {
                "id": "BL02",
                "name": "永寧",
                "x": 157,
                "y": 1276
            },
            {
                "id": "BL01",
                "name": "頂埔",
                "x": 126,
                "y": 1306
            }
        ]
    },
    {
        "name": "松山新店線",
        "color": "var(--green)",
        "stations": [
            {
                "id": "G01",
                "name": "新店",
                "x": 542,
                "y": 1302
            },
            {
                "id": "G02",
                "name": "新店區公所",
                "x": 542,
                "y": 1263
            },
            {
                "id": "G03",
                "name": "七張",
                "x": 542,
                "y": 1223
            },
            {
                "id": "G04",
                "name": "大坪林",
                "x": 542,
                "y": 1176,
                "transfer": [
                    "G",
                    "O"
                ]
            },
            {
                "id": "G05",
                "name": "景美",
                "x": 542,
                "y": 1130
            },
            {
                "id": "G06",
                "name": "萬隆",
                "x": 542,
                "y": 1085
            },
            {
                "id": "G07",
                "name": "公館",
                "x": 512,
                "y": 1046
            },
            {
                "id": "G08",
                "name": "台電大樓",
                "x": 480,
                "y": 1012
            },
            {
                "id": "G09",
                "name": "古亭",
                "x": 442,
                "y": 975,
                "transfer": [
                    "G",
                    "O"
                ]
            },
            {
                "id": "G10",
                "name": "中正紀念堂",
                "x": 408,
                "y": 942, 
                "transfer": [
                    "G",
                    "R"
                ]
            },
            {
                "id": "G11",
                "name": "小南門",
                "x": 350,
                "y": 942
            },
            {
                "id": "G12",
                "name": "西門",
                "x": 350,
                "y": 870,
                "transfer": [
                    "G",
                    "BL"
                ]
            },
            {
                "id": "G13",
                "name": "北門",
                "x": 350,
                "y": 800
            },
            {
                "id": "G14",
                "name": "中山",
                "x": 408,
                "y": 800,
                "transfer": [
                    "G",
                    "R"
                ]
            },
            {
                "id": "G15",
                "name": "松江南京",
                "x": 489,
                "y": 800,
                "transfer": [
                    "G",
                    "O"
                ]
            },
            {
                "id": "G16",
                "name": "南京復興",
                "x": 561,
                "y": 800,
                "transfer": [
                    "G",
                    "BR"
                ]
            },
            {
                "id": "G17",
                "name": "台北小巨蛋",
                "x": 612,
                "y": 800
            },
            {
                "id": "G18",
                "name": "南京三民",
                "x": 677,
                "y": 800
            },
            {
                "id": "G19",
                "name": "松山",
                "x": 747,
                "y": 800
            }
        ]
    },
    {
        "name": "中和新蘆線",
        "color": "var(--orange)",
        "stations": [
            {
                "id": "O01",
                "name": "南勢角",
                "x": 377,
                "y": 1179
            },
            {
                "id": "O02",
                "name": "景安",
                "x": 377,
                "y": 1137
            },
            {
                "id": "O03",
                "name": "永安市場",
                "x": 377,
                "y": 1097
            },
            {
                "id": "O04",
                "name": "頂溪",
                "x": 377,
                "y": 1060
            },
            {
                "id": "O05",
                "name": "古亭",
                "x": 442,
                "y": 975,
                "transfer": [
                    "O",
                    "G"
                ]
            },
            {
                "id": "O06",
                "name": "東門",
                "x": 489,
                "y": 942,
                "transfer": [
                    "O",
                    "R"
                ]
            },
            {
                "id": "O07",
                "name": "忠孝新生",
                "x": 489,
                "y": 870,
                "transfer": [
                    "O",
                    "BL"
                ]
            },
            {
                "id": "O08",
                "name": "松江南京",
                "x": 489,
                "y": 800,
                "transfer": [
                    "O",
                    "G"
                ]
            },
            {
                "id": "O09",
                "name": "行天宮",
                "x": 489,
                "y": 748
            },
            {
                "id": "O10",
                "name": "中山國小",
                "x": 460,
                "y": 713
            },
            {
                "id": "O11",
                "name": "民權西路",
                "x": 408,
                "y": 713,
                "transfer": [
                    "O",
                    "R"
                ]
            },
            {
                "id": "O12",
                "name": "大橋頭",
                "x": 350,
                "y": 713
            },
            {
                "id": "O13",
                "name": "台北橋",
                "x": 301,
                "y": 737
            },
            {
                "id": "O14",
                "name": "菜寮",
                "x": 269,
                "y": 769
            },
            {
                "id": "O15",
                "name": "三重",
                "x": 236,
                "y": 802
            },
            {
                "id": "O16",
                "name": "先嗇宮",
                "x": 204,
                "y": 834
            },
            {
                "id": "O17",
                "name": "頭前庄",
                "x": 172,
                "y": 867,
                "transfer": [
                    "O",
                    "Y"
                ]
            },
            {
                "id": "O18",
                "name": "新莊",
                "x": 139,
                "y": 899
            },
            {
                "id": "O19",
                "name": "輔大",
                "x": 107,
                "y": 931
            },
            {
                "id": "O20",
                "name": "丹鳳",
                "x": 74,
                "y": 964
            },
            {
                "id": "O21",
                "name": "迴龍",
                "x": 42,
                "y": 996
            },
            {
                "id": "O00",
                "name": "placeholder",
                "x": null,
                "y": null
            },
            {
                "id": "O12",
                "name": "大橋頭",
                "x": 350,
                "y": 713
            },
            {
                "id": "O50",
                "name": "三重國小",
                "x": 290,
                "y": 684
            },
            {
                "id": "O51",
                "name": "三和國中",
                "x": 261,
                "y": 656
            },
            {
                "id": "O52",
                "name": "徐匯中學",
                "x": 233,
                "y": 628
            },
            {
                "id": "O53",
                "name": "三民高中",
                "x": 204,
                "y": 599
            },
            {
                "id": "O54",
                "name": "蘆洲",
                "x": 175,
                "y": 571
            }
        ]
    },
    {
        "name": "文湖線",
        "color": "var(--brown)",
        "stations": [
            {
                "id": "BR01",
                "name": "動物園",
                "x": 804,
                "y": 1103
            },
            {
                "id": "BR02",
                "name": "木柵",
                "x": 752,
                "y": 1103
            },
            {
                "id": "BR03",
                "name": "萬芳社區",
                "x": 705,
                "y": 1103
            },
            {
                "id": "BR04",
                "name": "萬芳醫院",
                "x": 655,
                "y": 1103
            },
            {
                "id": "BR05",
                "name": "辛亥",
                "x": 655,
                "y": 1051
            },
            {
                "id": "BR06",
                "name": "麟光",
                "x": 655,
                "y": 1004
            },
            {
                "id": "BR07",
                "name": "六張犁",
                "x": 604,
                "y": 1004
            },
            {
                "id": "BR08",
                "name": "科技大樓",
                "x": 561,
                "y": 1004
            },
            {
                "id": "BR09",
                "name": "大安",
                "x": 561,
                "y": 942,
                "transfer": [
                    "BR",
                    "R"
                ]
            },
            {
                "id": "BR10",
                "name": "忠孝復興",
                "x": 561,
                "y": 870,
                "transfer": [
                    "BR",
                    "BL"
                ]
            },
            {
                "id": "BR11",
                "name": "南京復興",
                "x": 561,
                "y": 800,
                "transfer": [
                    "BR",
                    "G"
                ]
            },
            {
                "id": "BR12",
                "name": "中山國中",
                "x": 561,
                "y": 738
            },
            {
                "id": "BR13",
                "name": "松山機場",
                "x": 561,
                "y": 689
            },
            {
                "id": "BR14",
                "name": "大直",
                "x": 561,
                "y": 604
            },
            {
                "id": "BR15",
                "name": "劍南路",
                "x": 611,
                "y": 604
            },
            {
                "id": "BR16",
                "name": "西湖",
                "x": 661,
                "y": 604
            },
            {
                "id": "BR17",
                "name": "港墘",
                "x": 710,
                "y": 604
            },
            {
                "id": "BR18",
                "name": "文德",
                "x": 760,
                "y": 604
            },
            {
                "id": "BR19",
                "name": "內湖",
                "x": 810,
                "y": 604
            },
            {
                "id": "BR20",
                "name": "大湖公園",
                "x": 851,
                "y": 630
            },
            {
                "id": "BR21",
                "name": "葫洲",
                "x": 886,
                "y": 664
            },
            {
                "id": "BR22",
                "name": "東湖",
                "x": 903,
                "y": 710
            },
            {
                "id": "BR23",
                "name": "南港軟體園區",
                "x": 903,
                "y": 762
            },
            {
                "id": "BR24",
                "name": "南港展覽館",
                "x": 903,
                "y": 815,
                "transfer": [
                    "BR",
                    "BL"
                ]
            }
        ]
    },
    {
        "name": "環狀線",
        "color": "var(--yellow)",
        "stations": [
            {
                "id": "Y07",
                "name": "大坪林",
                "x": 542,
                "y": 1176,
                "transfer": [
                    "Y",
                    "G"
                ]
            },
            {
                "id": "Y08",
                "name": "十四張",
                "x": 493,
                "y": 1176
            },
            {
                "id": "Y09",
                "name": "秀朗橋",
                "x": 492,
                "y": 1176
            },
            {
                "id": "Y10",
                "name": "景平",
                "x": 427,
                "y": 1147
            },
            {
                "id": "Y11",
                "name": "景安",
                "x": 377,
                "y": 1137,
                "transfer": [
                    "Y",
                    "O"
                ]
            },
            {
                "id": "Y12",
                "name": "中和",
                "x": 325,
                "y": 1137
            },
            {
                "id": "Y13",
                "name": "橋和",
                "x": 285,
                "y": 1137
            },
            {
                "id": "Y14",
                "name": "中原",
                "x": 257,
                "y": 1103
            },
            {
                "id": "Y15",
                "name": "板新",
                "x": 228,
                "y": 1073
            },
            {
                "id": "Y16",
                "name": "板橋",
                "x": 181,
                "y": 1058,
                "transfer": [
                    "Y",
                    "BL"
                ]
            },
            {
                "id": "Y17",
                "name": "新埔民生",
                "x": 181,
                "y": 1016
            },
            {
                "id": "Y18",
                "name": "頭前庄",
                "x": 172,
                "y": 867,
                "transfer": [
                    "O",
                    "Y"
                ]
            },
            {
                "id": "Y19",
                "name": "幸福",
                "x": 172,
                "y": 823
            },
            {
                "id": "Y20",
                "name": "新北產業園區",
                "x": 172,
                "y": 782
            }
        ]
    },
    /**{
        "name": "機場線",
        "color": "var(--purple)",
        "stations": [
            {
                "id": "A1",
                "name": "台北車站",
                "x": 600,
                "y": 60,
                "transfer": [
                    "A",
                    "R",
                    "BL",
                    "G"
                ]
            },
            {
                "id": "A2",
                "name": "三重",
                "x": 390,
                "y": 270,
                "transfer": [
                    "A",
                    "O"
                ]
            },
            {
                "id": "A3",
                "name": "新北產業園區",
                "x": 600,
                "y": 100,
                "transfer": [
                    "A",
                    "Y"
                ]
            },
            {
                "id": "A4",
                "name": "新莊副都心",
                "x": 620,
                "y": 80
            },
            {
                "id": "A5",
                "name": "泰山",
                "x": 640,
                "y": 60
            },
            {
                "id": "A6",
                "name": "泰山貴和",
                "x": 660,
                "y": 40
            },
            {
                "id": "A7",
                "name": "新北產業園區",
                "x": 680,
                "y": 20
            },
            {
                "id": "A8",
                "name": "長庚醫院",
                "x": 700,
                "y": 0
            },
            {
                "id": "A9",
                "name": "林口",
                "x": 720,
                "y": -20
            },
            {
                "id": "A10",
                "name": "山鼻",
                "x": 740,
                "y": -40
            },
            {
                "id": "A11",
                "name": "機場第一航廈",
                "x": 760,
                "y": -60
            },
            {
                "id": "A12",
                "name": "機場第二航廈",
                "x": 780,
                "y": -80
            },
            {
                "id": "A13",
                "name": "機場旅館",
                "x": 800,
                "y": -100
            },
            {
                "id": "A14",
                "name": "高鐵桃園站",
                "x": 820,
                "y": -120
            },
            {
                "id": "A15",
                "name": "大園",
                "x": 840,
                "y": -140
            },
            {
                "id": "A16",
                "name": "橫山",
                "x": 860,
                "y": -160
            },
            {
                "id": "A17",
                "name": "領航",
                "x": 880,
                "y": -180
            },
            {
                "id": "A18",
                "name": "高鐵桃園站",
                "x": 900,
                "y": -200
            },
            {
                "id": "A19",
                "name": "環北",
                "x": 920,
                "y": -220
            }
        ]
    },
    {
        "name": "淡海輕軌",
        "color": "var(--light-green)",
        "stations": [
            {
                "id": "V01",
                "name": "紅樹林",
                "x": 90,
                "y": 90,
                "transfer": [
                    "V",
                    "R"
                ]
            },
            {
                "id": "V02",
                "name": "竿蓁林",
                "x": 70,
                "y": 110
            },
            {
                "id": "V03",
                "name": "淡金鄧公",
                "x": 50,
                "y": 130
            },
            {
                "id": "V04",
                "name": "淡江大學",
                "x": 30,
                "y": 150
            },
            {
                "id": "V05",
                "name": "淡水行政中心",
                "x": 10,
                "y": 170
            },
            {
                "id": "V06",
                "name": "濱海義山",
                "x": -10,
                "y": 190
            },
            {
                "id": "V07",
                "name": "濱海沙崙",
                "x": -30,
                "y": 210
            },
            {
                "id": "V08",
                "name": "淡海新市鎮",
                "x": -50,
                "y": 230
            },
            {
                "id": "V09",
                "name": "崁頂",
                "x": -70,
                "y": 250
            },
            {
                "id": "V10",
                "name": "沙崙",
                "x": -90,
                "y": 270
            }
        ]
    },
    {
        "name": "安坑輕軌",
        "color": "var(--light-green)",
        "stations": [
            {
                "id": "K01",
                "name": "十四張",
                "x": 200,
                "y": 480,
                "transfer": [
                    "K",
                    "Y"
                ]
            },
            {
                "id": "K02",
                "name": "秀朗橋",
                "x": 220,
                "y": 460,
                "transfer": [
                    "K",
                    "Y"
                ]
            },
            {
                "id": "K03",
                "name": "新和國小",
                "x": 240,
                "y": 440
            },
            {
                "id": "K04",
                "name": "陽光運動公園",
                "x": 260,
                "y": 420
            },
            {
                "id": "K05",
                "name": "安康",
                "x": 280,
                "y": 400
            },
            {
                "id": "K06",
                "name": "景文科大",
                "x": 300,
                "y": 380
            },
            {
                "id": "K07",
                "name": "雙城",
                "x": 320,
                "y": 360
            },
            {
                "id": "K08",
                "name": "安坑",
                "x": 340,
                "y": 340
            }
        ]
    }**/
]